'use strict';
// Постоянные
	const body 				= document.querySelector('body'),
				table 			= document.querySelector('table'),
				tbody 			= document.querySelector('tbody'),
				// filter options
				cont_All 		= document.querySelector('#continents_All'),
				cont_Other 	= document.querySelectorAll('#continents_All ~ [id]'),
				nas_All 		= document.querySelector('#nas_All'),
				nas_Other 	= document.querySelectorAll('#nas_All ~ [id]'),
				terra_All 	= document.querySelector('#terra_All'),
				terra_Other = document.querySelectorAll('#terra_All ~ [id]'),
				filters = {
					continents_All: 1,
					africa: 				0,
					america: 				0,
					asia: 					0,
					europa: 				0,
					oceania: 				0,
					nas_All: 				1,
					nas_0: 					0,
					nas_1: 					0,
					nas_2: 					0,
					nas_3: 					0,
					nas_4: 					0,
					nas_5: 					0,
					nas_6: 					0,
					nas_7: 					0,
					terra_All: 			1,
					dwarf: 					0,
					tiny: 					0,
					verySmall: 			0,
					small: 					0,
					medium: 				0,
					big: 						0,
					veryBig: 				0,
					huge: 					0,};

const whenua = [
	['AUS','Австралия','Канберра','Океания',25728080,7686850],
	['AUT','Австрия','Вена','Европа',8902600,83871],
	['AZE','Азербайджан','Баку','Азия',10067108,75100],
	['ALA','Аландские острова','Мариехамн','Европа',29931,1553],
	['ALB','Албания','Тирана','Европа',2845955,28748],
	['ALG','Алжир','Алжир','Африка',43000000,2381740],
	['ASA','Американское Самоа','Паго-Паго','Океания',56700,199],
	['AIA','Ангилья','Валли','Америка',14869,100],
	['ANG','Ангола','Луанда','Африка',31127674,1246700],
	['AND','Андорра','Андорра-ла-Велья','Европа',77543,468],
	['ATA','Антарктида','—','Антарктида',0,14107000],
	['ATG','Антигуа и Барбуда','Сент-Джонс','Америка',96453,442],
	['ARG','Аргентина','Буэнос-Айрес','Америка',44938712,2780400],
	['ARM','Армения','Ереван','Азия',2956900,29743],
	['ARU','Аруба','Ораньестад','Америка',112190,193],
	['AFG','Афганистан','Кабул','Азия',32225560,647500],
	['BAH','Багамы','Нассау','Америка',385340,13940],
	['BAN','Бангладеш','Дакка','Азия',175000000,144000],
	['BRB','Барбадос','Бриджтаун','Америка',287025,430],
	['BHR','Бахрейн','Манама','Азия',1543300,665],
	['BLZ','Белиз','Бельмопан','Америка',408487,22966],
	['BLR','Белоруссия','Минск','Европа',9397800,207600],
	['BEL','Бельгия','Брюссель','Европа',11534131,32545],
	['BEN','Бенин','Порто-Ново','Африка',11733059,112620],
	['BER','Бермуды','Гамильтон','Америка',64027,54],
	['BUL','Болгария','София','Европа',6951482,110910],
	['BOL','Боливия','Сукре','Америка',11469896,1098580],
	['BES','Бонайре, Синт-Эстатиус и Саба','Кралендейк','Америка',25000,322],
	['BIH','Босния и Герцеговина','Сараево','Европа',3301000,51129],
	['BOT','Ботсвана','Габороне','Африка',2338851,581730],
	['BRA','Бразилия','Бразилиа','Америка',213710000,8515767],
	['BRU','Бруней','Бандар-Сери-Бегаван','Азия',459500,5770],
	['BFA','Буркина-Фасо','Уагадугу','Африка',21510181,274200],
	['BDI','Бурунди','Бужумбура','Африка',10953317,27830],
	['BHU','Бутан','Тхимпху','Азия',741672,47000],
	['VAN','Вануату','Порт-Вила','Океания',304500,12200],
	['VAT','Ватикан','Ватикан','Европа',453,0],
	['GBR','Великобритания','Лондон','Европа',67081234,244820],
	['HUN','Венгрия','Будапешт','Европа',9769000,93030],
	['VEN','Венесуэла','Каракас','Америка',32219521,912050],
	['VGB','Виргинские Острова (Великобритания)','Род-Таун','Америка',30030,153],
	['VIR','Виргинские Острова (США)','Шарлотта-Амалия','Америка',104578,352],
	['TLS','Восточный Тимор','Дили','Азия',1387149,14874],
	['VIE','Вьетнам','Ханой','Азия',98208984,329560],
	['GAB','Габон','Либревиль','Африка',2172579,267667],
	['HAI','Гаити','Порт-о-Пренс','Америка',11577779,27750],
	['GUY','Гайана','Джорджтаун','Америка',782766,214970],
	['GAM','Гамбия','Банжул','Африка',2347706,11300],
	['GHA','Гана','Аккра','Африка',30280811,238540],
	['GPE','Гваделупа','Бас-Тер','Америка',403750,1780],
	['GUA','Гватемала','Гватемала','Америка',16604026,108890],
	['GUI','Гвинея','Конакри','Африка',12218357,245857],
	['GNB','Гвинея-Бисау','Бисау','Африка',1604528,36120],
	['GER','Германия','Берлин','Европа',83149300,357021],
	['GGY','Гернси','Сент-Питер-Порт','Европа',63196,78],
	['GIB','Гибралтар','Гибралтар','Европа',33691,7],
	['HON','Гондурас','Тегусигальпа','Америка',9158345,112090],
	['HKG','Гонконг','—','Азия',7500700,1016],
	['GRN','Гренада','Сент-Джорджес','Америка',112003,340],
	['GRL','Гренландия','Нуук','Америка',56081,2166086],
	['GRE','Греция','Афины','Европа',10724599,131940],
	['GEO','Грузия','Тбилиси','Азия',3716858,57200],
	['GUM','Гуам','Хагатна','Океания',172400,548],
	['DEN','Дания','Копенгаген','Европа',5824857,43094],
	['COD','Демократическая Республика Конго','Киншаса','Африка',97000000,2345410],
	['JEY','Джерси','Сент-Хелиер','Европа',106800,116],
	['DJI','Джибути','Джибути','Африка',1078373,22000],
	['DMA','Доминика','Розо','Америка',71808,754],
	['DOM','Доминиканская Республика','Санто-Доминго','Америка',10358320,48730],
	['EGY','Египет','Каир','Африка',103456444,1001450],
	['ZAM','Замбия','Лусака','Африка',17885422,752614],
	['SAH','Западная Сахара','Эль-Аюн','Африка',582463,266000],
	['ZIM','Зимбабве','Хараре','Африка',15159624,390580],
	['ISR','Израиль','Иерусалим','Азия',9204865,22072],
	['IND','Индия','Нью-Дели','Азия',1393809280,3287590],
	['IDN','Индонезия','Джакарта','Азия',271350000,1904556],
	['JOR','Иордания','Амман','Азия',10693560,92300],
	['IRQ','Ирак','Багдад','Азия',40150200,437072],
	['IRN','Иран','Тегеран','Азия',85497484,1648000],
	['IRL','Ирландия','Дублин','Европа',4921500,70273],
	['ISL','Исландия','Рейкьявик','Европа',366130,103000],
	['ESP','Испания','Мадрид','Европа',47100396,497304],
	['ITA','Италия','Рим','Европа',60238522,301340],
	['YEM','Йемен','Сана','Азия',29825968,527970],
	['CPV','Кабо-Верде','Прая','Африка',550483,4033],
	['KAZ','Казахстан','Нур-Султан','Азия',18712048,2724902],
	['CAM','Камбоджа','Пномпень','Азия',15288489,181040],
	['CMR','Камерун','Яунде','Африка',26545864,475440],
	['CAN','Канада','Оттава','Америка',38050445,9984670],
	['QAT','Катар','Доха','Азия',2795484,11437],
	['KEN','Кения','Найроби','Африка',47564296,582650],
	['CYP','Кипр','Никосия','Европа',875900,6000],
	['KGZ','Киргизия','Бишкек','Азия',6533500,198500],
	['KIR','Кирибати','Южная Тарава','Океания',120100,717],
	['CHN','Китай','Пекин','Азия',1430915880,9598962],
	['PRK','КНДР','Пхеньян','Азия',25450000,120540],
	['CC','Кокосовые острова (Килинг)','Уэст-Айленд','Азия',555,14],
	['COL','Колумбия','Богота','Америка',50395678,1138910],
	['COM','Коморы','Морони','Африка',873724,1862],
	['CGO','Конго','Браззавиль','Африка',5518092,342000],
	['CRC','Коста-Рика','Сан-Хосе','Америка',5058007,51100],
	['CIV','Кот-д’Ивуар','Ямусукро','Африка',25823071,322460],
	['CUB','Куба','Гавана','Америка',11209628,110860],
	['KUW','Кувейт','Эль-Кувейт','Азия',4420110,17820],
	['CUW','Кюрасао','Виллемстад','Америка',156223,444],
	['LAO','Лаос','Вьентьян','Азия',7123205,236800],
	['LVA','Латвия','Рига','Европа',1904600,64589],
	['LES','Лесото','Масеру','Африка',2007201,30355],
	['LBR','Либерия','Монровия','Африка',4475353,111370],
	['LIB','Ливан','Бейрут','Азия',6825442,10452],
	['LBY','Ливия','Триполи','Африка',6871287,1759540],
	['LTU','Литва','Вильнюс','Европа',2793271,65200],
	['LIE','Лихтенштейн','Вадуц','Европа',38749,160],
	['LUX','Люксембург','Люксембург','Европа',626108,2586],
	['MRI','Маврикий','Порт-Луи','Африка',1265475,2040],
	['MTN','Мавритания','Нуакшот','Африка',4077347,1030700],
	['MAD','Мадагаскар','Антананариву','Африка',26251309,587040],
	['MYT','Майотта','Мамудзу','Африка',246496,374],
	['MAC','Макао','—','Азия',696100,31],
	['MWI','Малави','Лилонгве','Африка',19129952,118480],
	['MAS','Малайзия','Куала-Лумпур','Азия',32798760,329750],
	['MLI','Мали','Бамако','Африка',20250833,1240000],
	['MDV','Мальдивы','Мале','Азия',374775,298],
	['MLT','Мальта','Валлетта','Европа',493559,316],
	['MAR','Марокко','Рабат','Африка',35915525,446550],
	['MTQ','Мартиника','Фор-де-Франс','Америка',381326,1100],
	['MHL','Маршалловы Острова','Маджуро','Океания',55500,181],
	['MEX','Мексика','Мехико','Америка',126014024,1972550],
	['MOZ','Мозамбик','Мапуту','Африка',30066648,801590],
	['MDA','Молдавия','Кишинёв','Европа',2681735,29680],
	['MCO','Монако','Монако','Европа',38100,2],
	['MGL','Монголия','Улан-Батор','Азия',3320588,1564116],
	['MSR','Монтсеррат','Плимут / Брейдс','Америка',4989,102],
	['MYA','Мьянма','Нейпьидо','Азия',54817919,678500],
	['NAM','Намибия','Виндхук','Африка',2746746,825418],
	['NRU','Науру','Ярен','Океания',11000,21],
	['NEP','Непал','Катманду','Азия',29996478,140800],
	['NIG','Нигер','Ниамей','Африка',22314743,1267000],
	['NGA','Нигерия','Абуджа','Африка',213000000,923768],
	['NED','Нидерланды','Амстердам','Европа',17472381,41526],
	['NCA','Никарагуа','Манагуа','Америка',6460411,129494],
	['NIU','Ниуэ','Алофи','Океания',1520,260],
	['NZL','Новая Зеландия','Веллингтон','Океания',5006437,268680],
	['NCL','Новая Каледония','Нумеа','Океания',271407,19060],
	['NOR','Норвегия','Осло','Европа',5372355,324220],
	['UAE','Объединённые Арабские Эмираты','Абу-Даби','Азия',9890400,82880],
	['OMA','Оман','Маскат','Азия',4645249,309500],
	['IMN','Остров Мэн','Дуглас','Европа',83314,572],
	['NF','Остров Норфолк','Кингстон','Океания',1735,35],
	['CX','Остров Рождества','Флайинг-Фиш-Коув','Азия',1955,135],
	['SHN','Остров Святой Елены','Джеймстаун','Африка',5633,410],
	['CAY','Острова Кайман','Джорджтаун','Америка',65813,262],
	['COK','Острова Кука','Аваруа','Океания',15200,240],
	['PCN','Острова Питкэрн','Адамстаун','Океания',50,47],
	['PAK','Пакистан','Исламабад','Азия',227983706,803940],
	['PLW','Палау','Нгерулмуд','Океания',17900,458],
	['PLE','Палестина','Рамалла','Азия',4976684,6020],
	['PAN','Панама','Панама','Америка',4218808,78200],
	['PNG','Папуа — Новая Гвинея','Порт-Морсби','Океания',8935000,462840],
	['PAR','Парагвай','Асунсьон','Америка',7252672,406750],
	['PER','Перу','Лима','Америка',32824358,1285220],
	['POL','Польша','Варшава','Европа',38379000,312685],
	['POR','Португалия','Лиссабон','Европа',10276617,92082],
	['RMN','Приднестровская Молдавская Республика','Тирасполь','Европа',469000,4163],
	['PUR','Пуэрто-Рико','Сан-Хуан','Америка',3193694,9104],
	['ABH','Республика Абхазия','Сухуми','Азия',244832,8600],
	['Atsakh','Республика Арцах','Степанакерт','Азия',148000,11458],
	['KOR','Республика Корея','Сеул','Азия',51780579,98480],
	['KVX','Республика Косово','Приштина','Европа',1795666,10888],
	['REU','Реюньон','Сен-Дени','Африка',844994,2517],
	['RUS','Россия','Москва','Европа',146171015,17125191],
	['RWA','Руанда','Кигали','Африка',12374397,26338],
	['ROU','Румыния','Бухарест','Европа',19405156,237500],
	['SLV','Сальвадор','Сан-Сальвадор','Америка',6486201,21040],
	['SAM','Самоа','Апиа','Океания',200874,2860],
	['SMR','Сан-Марино','Сан-Марино','Европа',33553,61],
	['STP','Сан-Томе и Принсипи','Сан-Томе','Африка',210240,1001],
	['KSA','Саудовская Аравия','Эр-Рияд','Азия',34218169,2149690],
	['MKD','Северная Македония','Скопье','Европа',2077132,25333],
	['NMI','Северные Марианские Острова','Сайпан','Океания',56200,477],
	['SEY','Сейшельские Острова','Виктория','Африка',98055,455],
	['BLM','Сен-Бартелеми','Густавия','Америка',9961,21],
	['SEN','Сенегал','Дакар','Африка',16705608,196190],
	['SMT','Сен-Мартен','Мариго','Америка',35334,53],
	['SPM','Сен-Пьер и Микелон','Сен-Пьер','Америка',5997,242],
	['VIN','Сент-Винсент и Гренадины','Кингстаун','Америка',110608,389],
	['SKN','Сент-Китс и Невис','Бастер','Америка',52823,261],
	['LCA','Сент-Люсия','Кастри','Америка',178696,620],
	['SRB','Сербия','Белград','Европа',6963764,77473],
	['SIN','Сингапур','Сингапур','Азия',5703600,778],
	['SXM','Синт-Мартен','Филипсбург','Америка',40614,35],
	['SYR','Сирия','Дамаск','Азия',17500657,185180],
	['SVK','Словакия','Братислава','Европа',5457873,48845],
	['SVN','Словения','Любляна','Европа',2095861,20253],
	['USA','Соединённые Штаты Америки','Вашингтон','Америка',332514384,9525067],
	['SOL','Соломоновы Острова','Хониара','Океания',680806,28450],
	['SOM','Сомали','Могадишо','Африка',15893219,637657],
	['SUD','Судан','Хартум','Африка',42553875,1886065],
	['SUR','Суринам','Парамарибо','Америка',581372,163270],
	['SLE','Сьерра-Леоне','Фритаун','Африка',7901454,71740],
	['TJK','Таджикистан','Душанбе','Азия',9127000,143100],
	['THA','Таиланд','Бангкок','Азия',67512242,514000],
	['TPE','Тайвань (Китайская Республика)','Тайбэй','Азия',23596493,35980],
	['TAN','Танзания','Додома','Африка',63637628,948087],
	['TCA','Теркс и Кайкос','Коберн-Таун','Америка',42953,430],
	['TOG','Того','Ломе','Африка',7538000,56785],
	['TKL','Токелау','Атафу','Океания',1400,12],
	['TGA','Тонга','Нукуалофа','Океания',100651,748],
	['TRI','Тринидад и Тобаго','Порт-оф-Спейн','Америка',1363985,5128],
	['TUV','Тувалу','Фунафути','Океания',10200,26],
	['TUN','Тунис','Тунис','Африка',11722038,163610],
	['NCP','Турецкая Республика Северного Кипра','Никосия','Азия',351965,3300],
	['TKM','Туркмения','Ашхабад','Азия',6031187,491200],
	['TUR','Турция','Анкара','Азия',84154997,780580],
	['UGA','Уганда','Кампала','Африка',41590300,236040],
	['UZB','Узбекистан','Ташкент','Азия',34217144,447400],
	['UKR','Украина','Киев','Европа',41830619,576604],
	['WLF','Уоллис и Футуна','Мата-Уту','Океания',11700,274],
	['URU','Уругвай','Монтевидео','Америка',3518552,176220],
	['FRO','Фареры','Торсхавн','Европа',52428,1399],
	['FSM','Федеративные Штаты Микронезии','Паликир','Океания',104468,702],
	['FIJ','Фиджи','Сува','Океания',884887,18270],
	['PHI','Филиппины','Манила','Азия',110941613,299764],
	['FIN','Финляндия','Хельсинки','Европа',5498806,337030],
	['FLK','Фолклендские (Мальвинские) острова','Стэнли','Америка',3198,12173],
	['FRA','Франция','Париж','Европа',68075000,547030],
	['GYF','Французская Гвиана','Кайенна','Америка',254541,91000],
	['TAH','Французская Полинезия (Таити)','Папеэте','Океания',275918,4167],
	['CRO','Хорватия','Загреб','Европа',4076246,56542],
	['CTA','Центральноафриканская Республика','Банги','Африка',5496011,622984],
	['CHA','Чад','Нджамена','Африка',16244513,1284000],
	['MNE','Черногория','Подгорица','Европа',622359,14026],
	['CZE','Чехия','Прага','Европа',10693939,78866],
	['CHI','Чили','Сантьяго','Америка',19107216,756950],
	['SUI','Швейцария','Берн','Европа',8603899,41290],
	['SWE','Швеция','Стокгольм','Европа',10343403,449964],
	['SRI','Шри-Ланка','Шри-Джаяварденепура-Котте','Азия',21803000,65610],
	['ECU','Эквадор','Кито','Америка',17497960,283560],
	['EQG','Экваториальная Гвинея','Малабо','Африка',1454789,28051],
	['ERI','Эритрея','Асмэра','Африка',3497117,121320],
	['SWZ','Эсватини','Мбабане','Африка',1093238,17363],
	['EST','Эстония','Таллин','Европа',1328976,45226],
	['ETH','Эфиопия','Аддис-Абеба','Африка',117876000,1127127],
	['OSE','Южная Осетия','Цхинвал','Азия',53532,3900],
	['RSA','Южно-Африканская Республика','Претория','Африка',61075022,1219912],
	['SSD','Южный Судан','Джуба','Африка',12778250,619745],
	['JAM','Ямайка','Кингстон','Америка',2726667,10990],
	['JPN','Япония','Токио','Азия',125900000,377835],
];

createTable();

function createTable() {
	tbody.innerHTML = whenua.map(X => `
		<tr class="${X[0]}">
		<td><p>${X[1]}</p></td>
		<td>${X[2]}</td>
		<td>${X[3]}</td>
		<td>${X[4].toLocaleString('ru')}</td>
		<td>${X[5].toLocaleString('ru')}</td>
		</tr>`).join('');
}
function clickSort() {
	let COL = this.getAttribute('id'),
			CLS = this.classList;
	if (CLS.contains('sorted')) 
		{sorting('reverse');
		CLS.toggle('z-a');}
	else {
		sorting(COL);
		cleanClassesTH();
		CLS.add('sorted');
		if (COL == 'naselenie' || COL == 'terra') {CLS.add('z-a');} }
}
function sorting(COL) {
	let sortedRows = Array.from(document.querySelectorAll('tbody>tr'));
	if (COL === 'reverse') {sortedRows.reverse();}
	else if (COL === 'naselenie' || COL === 'terra') {
		if (COL === 'naselenie') { COL = 3 }
		if (COL === 'terra') { COL = 4 }
		for (let i = 0; i < sortedRows.length; i++) 
			{sortedRows[i].cells[COL].innerHTML = sortedRows[i].cells[COL].innerHTML.replace(/&nbsp;/g, "").replace(/ /g, "");}
		sortedRows.sort((a, b) => b.cells[COL].innerHTML - a.cells[COL].innerHTML);
		for (let i = 0; i < sortedRows.length; i++) 
			{sortedRows[i].cells[COL].innerHTML = sortedRows[i].cells[COL].innerHTML.replace(/\B(?=(\d{3})+(?!\d))/g, " ");} }
	else {
		if (COL === 'strana') { COL = 0 }
		if (COL === 'stolica') { COL = 1 }
		if (COL === 'continent') { COL = 2 }
		sortedRows.sort((a, b) => a.cells[COL].innerHTML.toLowerCase() > b.cells[COL].innerHTML.toLowerCase() ? 1 : -1 ); }
	document.querySelector('tbody').append(...sortedRows);
}
function activeOption() {
	if (filters.continents_All) { cont_All.className = 'active'; }
	if (filters.nas_All) { nas_All.className = 'active'; }
	if (filters.terra_All) { terra_All.className = 'active'; }
}
function clickFilter() {
	let ID = this.getAttribute('id');
	// Фильтры "Все"
	if (ID === 'continents_All') {
		filters[ID] = true;
		filters.africa = filters.america = filters.asia = filters.europa = filters.oceania = false;
		for (let i = 0; i < cont_Other.length; i++) {cont_Other[i].className = ''} }
	else if (ID === 'nas_All') {
		filters[ID] = true;
		filters.nas_0 = filters.nas_1 = filters.nas_2 = filters.nas_3 = filters.nas_4 = filters.nas_5 = filters.nas_6 = filters.nas_7 = false;
		for (let i = 0; i < nas_Other.length; i++) {nas_Other[i].className = ''} }
	else if (ID === 'terra_All') {
		filters[ID] = true;
		filters.dwarf = filters.tiny = filters.verySmall = filters.small = filters.medium = filters.big = filters.veryBig = filters.huge = false;
		for (let i = 0; i < terra_Other.length; i++) {terra_Other[i].className = ''} }
	// Отдельные фильтры
	else {
		filters[ID] = !filters[ID];
		this.classList.toggle('active');
		if (filters.africa || filters.america || filters.asia || filters.europa || filters.oceania) 
			{filters.continents_All = false; cont_All.className = '';}
		else {filters.continents_All = true;} 
		if (filters.nas_0 || filters.nas_1 || filters.nas_2 || filters.nas_3 || filters.nas_4 || filters.nas_5 || filters.nas_6 || filters.nas_7) 
			{filters.nas_All = false; nas_All.className = '';}
		else {filters.nas_All = true;} 
		if (filters.dwarf || filters.tiny || filters.verySmall || filters.small || filters.medium || filters.big || filters.veryBig || filters.huge) 
			{filters.terra_All = false; terra_All.className = '';}
		else {filters.terra_All = true;} }

	if (ID == 'continents_All' || ID == 'africa' || ID == 'america' || ID == 'asia' || ID == 'europa' || ID == 'oceania') {}
	else filterLinkLabelValues(ID);
	activeOption();
	filtering();
}
function filtering() {
	for (let i = 1; i < table.rows.length; i++) {
		let C = table.rows[i].cells[2].innerHTML,
				TR = table.rows[i].classList;
		if (
			filters.continents_All || 
			((F[0]) 	&& C == 'Африка') ||
			((filters.america) 	&& C == 'Америка') ||
			((filters.asia) 		&& C == 'Азия') ||
			((filters.europa) 	&& C == 'Европа') ||
			((filters.oceania) 	&& C == 'Океания') )
			{TR.remove('hiddenByCont');}
		else {TR.add('hiddenByCont');} }
}
function filterLinkLabelValues(ID) {
	let MIN, MAX, prefix;
	if (ID.includes('nas_')) {
		prefix = '#nas_';
	// Население
		if (filters.nas_All) {
			MIN = MAX = '';
		} else if (filters.nas_0) {
			MIN = '0';
			MAX = '100 000';
		} else if (filters.nas_1) {
			MIN = '100 000';
			MAX = '1 000 000';
		} else if (filters.nas_2) {
			MIN = '1 000 000';
			MAX = '5 000 000';
		} else if (filters.nas_3) {
			MIN = '5 000 000';
			MAX = '10 000 000';
		} else if (filters.nas_4) {
			MIN = '10 000 000';
			MAX = '25 000 000';
		} else if (filters.nas_5) {
			MIN = '25 000 000';
			MAX = '50 000 000';
		} else if (filters.nas_6) {
			MIN = '50 000 000';
			MAX = '100 000 000';
		} else if (filters.nas_7) {
			MIN = '100 000 000';
			MAX = '';
		}
	}
	else {
		prefix = '#terra_';
	// Размер
		if (filters.terra_All) {
			MIN = MAX = '';
		} else if (filters.dwarf) {
			MIN = '0';
			MAX = '2 586';
		} else if (filters.tiny) {
			MIN = '2 586';
			MAX = '31 000';
		} else if (filters.verySmall) {
			MIN = '31 000';
			MAX = '125 000';
		} else if (filters.small) {
			MIN = '125 000';
			MAX = '290 000';
		} else if (filters.medium) {
			MIN = '290 000';
			MAX = '700 000';
		} else if (filters.big) {
			MIN = '700 000';
			MAX = '1 300 000';
		} else if (filters.veryBig) {
			MIN = '1 300 000';
			MAX = '5 000 000';
		} else if (filters.huge) {
			MIN = '5 000 000';
			MAX = '';
		}
	}
	document.querySelector(prefix+'Min').value = MIN;
	document.querySelector(prefix+'Max').value = MAX;
	filterRanges(ID);
}
function filterRanges(a) {
	let MIN, MAX, CLASS, C, ID;
	if (this) ID = this.getAttribute('id');
	else ID = a;
	// NAS
	if (ID.includes('nas_')) {
		MIN = document.querySelector('#nas_Min').value.replace(/ /g, "");
		MAX = document.querySelector('#nas_Max').value.replace(/ /g, "");
		CLASS = 'hiddenByNas';
		C = 3;
	}
	// TERRA
	else {
		MIN = document.querySelector('#terra_Min').value.replace(/ /g, "");
		MAX = document.querySelector('#terra_Max').value.replace(/ /g, "");
		CLASS = 'hiddenByTerra';
		C = 4;
	}
	if (MAX < 1) {MAX = 1500000000;}
	for (let i = 1; i < table.rows.length; i++) {
		let TR = table.rows[i].classList,
		value = Number(table.rows[i].cells[C].innerHTML.replace(/&nbsp;/g, "").replace(/ /g, ""));
		if (value >= MIN && value <= MAX) TR.remove(CLASS);
		else TR.add(CLASS);
	}
	if (this) {this.value = this.value.replace(/ /g, "").replace(/\B(?=(?:\d{3})+(?!\d))/g, ' ');}
}
function tableSearch() {
	let regPhrase = new RegExp(document.querySelector('#tableSearch').value, 'i'),
			flag = false;
	for (let i = 1; i < table.rows.length; i++) {
		flag = false;
		for (let j = 0; j < 2; j++) {
			flag = regPhrase.test(table.rows[i].cells[j].innerHTML);
			if (flag) break;}
		if (flag) 
			{table.rows[i].classList.remove('hiddenBySearch');}
		else {table.rows[i].classList.add('hiddenBySearch');} } 
}
function cleanClassesTH() {for (let i = 0; i < 5; i++) {document.querySelectorAll('th')[i].className = ''} }

// Фильтр
document.querySelectorAll('.filter [id]').forEach((element) => {element.onclick = clickFilter;});
// Фильтры-диапазоны
document.querySelectorAll('.filterRanges input').forEach((element) => {element.oninput = filterRanges;});
// Сортировка
document.querySelectorAll('th').forEach((element) => {element.onclick = clickSort;});
// Поиск
document.querySelector('#tableSearch').oninput = tableSearch;
